import { App } from "koishi";

class Chess {

    app: App;
    private command: ['象棋帮助', '加入红方', '加入黑方', '查看积分'];

    chessBoard = {
        '红车1': [1, 1],
        '红马1': [2, 1],
        '红象1': [3, 1],
        '红士1': [4, 1],
        '红将1': [5, 1],
        '红士2': [6, 1],
        '红象2': [7, 1],
        '红马2': [8, 1],
        '红车2': [9, 1],
        '红炮1': [2, 3],
        '红炮2': [8, 3],
        '红兵1': [1, 4],
        '红兵2': [3, 4],
        '红兵3': [5, 4],
        '红兵4': [7, 4],
        '红兵5': [9, 4],

        '黑车1': [1, 10],
        '黑马1': [2, 10],
        '黑象1': [3, 10],
        '黑士1': [4, 10],
        '黑将1': [5, 10],
        '黑士2': [6, 10],
        '黑象2': [7, 10],
        '黑马2': [8, 10],
        '黑车2': [9, 10],
        '黑炮1': [2, 8],
        '黑炮2': [8, 8],
        '黑兵1': [1, 7],
        '黑兵2': [3, 7],
        '黑兵3': [5, 7],
        '黑兵4': [7, 7],
        '黑兵5': [9, 7]
    }

    constructor(app: App) {
        this.app = app;
        this.initReceiver();
    }

    initReceiver() {

    }

    getCamp(str: string) {
        if (str.startsWith('红') || str.startsWith('黑')) throw new Error('err');
        else return str[0];
    }
}